In [1]:
from google.colab import drive
drive.mount('drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at drive

In [0]:
import pandas as pd

In [3]:
college_data = pd.read_csv('/content/drive/My Drive/MERGED2017_18_PP.csv')

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (31,1726,1727,1728,1729,1815,1817,1823,1830,1879,1880,1881,1882,1883,1884,1885,1886,1887,1888,1889,1890,1891,1892,1893,1894,1895,1896,1897,1898,1957,1958,1959,1960,1961,1962,1963,1964,1965,1966,1967,1968,1969,1970,1971,1972,1973,1974,1975,1976) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [4]:
college_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7112 entries, 0 to 7111
Columns: 1977 entries, UNITID to OMENRUP_PARTTIME_POOLED_SUPP
dtypes: float64(1862), int64(14), object(101)
memory usage: 107.3+ MB

In [0]:
high_math = college_data[college_data['ACTCM75'] > 28]

In [10]:
high_math.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 267 entries, 3 to 6452
Columns: 1977 entries, UNITID to OMENRUP_PARTTIME_POOLED_SUPP
dtypes: float64(1862), int64(14), object(101)
memory usage: 4.0+ MB

In [64]:
high_math[['ACTCM75','INSTNM']].sort_values(ascending=False,by='ACTCM75')

      ACTCM75                                             INSTNM
212      35.0                 California Institute of Technology
930      35.0                              University of Chicago
633      35.0                                    Yale University
2967     35.0                         Carnegie Mellon University
325      35.0                                Harvey Mudd College
...       ...                                                ...
1843     29.0                          University of Mississippi
668      29.0                      University of Central Florida
2850     29.0               University of Oklahoma-Norman Campus
1846     29.0                                Mississippi College
3096     29.0  Pennsylvania State University-Penn State Mont ...

[267 rows x 2 columns]

In [0]:
total_math = college_data[college_data['ACTCM75'] > 1]

In [13]:
total_math.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1292 entries, 0 to 6643
Columns: 1977 entries, UNITID to OMENRUP_PARTTIME_POOLED_SUPP
dtypes: float64(1862), int64(14), object(101)
memory usage: 19.5+ MB

In [0]:
high_english = college_data[college_data['ACTEN75'] > 28]

In [23]:
high_english.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 309 entries, 1 to 6442
Columns: 1977 entries, UNITID to OMENRUP_PARTTIME_POOLED_SUPP
dtypes: float64(1862), int64(14), object(101)
memory usage: 4.7+ MB

In [63]:
high_english[['ACTCM75','INSTNM']].sort_values(ascending=False,by='ACTCM75')

      ACTCM75                                 INSTNM
325      35.0                    Harvey Mudd College
3189     35.0                       Brown University
2967     35.0             Carnegie Mellon University
2498     35.0                        Duke University
1473     35.0               Johns Hopkins University
...       ...                                    ...
1571     26.0     University of Massachusetts-Boston
2557     26.0         Queens University of Charlotte
1616     26.0  University of Massachusetts-Dartmouth
658      22.0         The Baptist College of Florida
1500      NaN            United States Naval Academy

[309 rows x 2 columns]

In [0]:
count_over_75k = college_data['GT_25K_P9']

this should not be blank, but it is the count of students making over 75k after 10 years from entry or if the parents made over 75k im not sure. Let me see how many columns have data.

In [38]:
count_over_75k.describe()

count    0.0
mean     NaN
std      NaN
min      NaN
25%      NaN
50%      NaN
75%      NaN
max      NaN
Name: GT_25K_P9, dtype: float64

In [32]:
len(college_data.columns[college_data.isna().any()].tolist())

1958

In [36]:
college_data['PCT90_EARN_WNE_P8'].isna().value_counts()

True    7112
Name: PCT90_EARN_WNE_P8, dtype: int64

From the little bit that I have tested the income numbers are completely not reported

In [0]:
count_over_75k = college_data['NUM45_PUB']

In [42]:
count_over_75k.value_counts()

0.0      564
1.0       78
2.0       65
4.0       45
6.0       38
        ...
242.0      1
312.0      1
116.0      1
143.0      1
999.0      1
Name: NUM45_PUB, Length: 343, dtype: int64

In [43]:
count_over_75k.describe()

count    1889.000000
mean       71.291159
std       154.627611
min         0.000000
25%         0.000000
50%        10.000000
75%        56.000000
max      1286.000000
Name: NUM45_PUB, dtype: float64

In [48]:
count_over_75k.isnull()

0       False
1       False
2        True
3       False
4       False
        ...
7107     True
7108     True
7109     True
7110     True
7111     True
Name: NUM45_PUB, Length: 7112, dtype: bool

The median amount of rich parents making $110k per year or more is only 10. Lets see which schools have the most

In [56]:
college_data[college_data['NUM45_PUB']> 0][['INSTNM','NUM45_PUB']].sort_values(ascending=False,by='NUM45_PUB')

                                               INSTNM  NUM45_PUB
3094        Pennsylvania State University-Main Campus     1286.0
1694                        Michigan State University     1097.0
2130                 Rutgers University-New Brunswick     1083.0
2658             University of Cincinnati-Main Campus     1064.0
3545           Texas A & M University-College Station     1036.0
...                                               ...        ...
317                        Glendale Community College        1.0
1312                   Hopkinsville Community College        1.0
4462                              South Texas College        1.0
4436  Eastland-Fairfield Career and Technical Schools        1.0
166                        Southeast Arkansas College        1.0

[1325 rows x 2 columns]

In [0]:
count_under_30k = college_data['NUM41_PUB']

In [59]:
count_under_30k.sort_values(ascending=False)

729     3894.0
2247    3093.0
1102    2394.0
704     2316.0
779     2214.0
         ...
7107       NaN
7108       NaN
7109       NaN
7110       NaN
7111       NaN
Name: NUM41_PUB, Length: 7112, dtype: float64

In [62]:
count_under_30k.describe()

count    1889.000000
mean      217.399153
std       280.898097
min         0.000000
25%        46.000000
50%       126.000000
75%       288.000000
max      3894.000000
Name: NUM41_PUB, dtype: float64

In [60]:
college_data[college_data['NUM42_PUB']> 0][['INSTNM','NUM42_PUB']].sort_values(ascending=False,by='NUM42_PUB')

                                             INSTNM  NUM42_PUB
729                              Miami Dade College      970.0
233              University of California-Riverside      842.0
2247    CUNY Borough of Manhattan Community College      816.0
231                 University of California-Irvine      713.0
227          California State University-Northridge      694.0
...                                             ...        ...
4523                    South Central Career Center        1.0
3394                        Alvin Community College        1.0
4007               Francis Tuttle Technology Center        1.0
4010  Career Technology Center of Lackawanna County        1.0
4912            East Valley Institute of Technology        1.0

[1786 rows x 2 columns]

In [66]:
most_expensive = college_data[college_data['TUITIONFEE_IN']>0][['INSTNM','TUITIONFEE_IN']].sort_values(ascending=False,by='TUITIONFEE_IN')
most_expensive

                                                 INSTNM  TUITIONFEE_IN
5199  Aviator College of Aeronautical Science and Te...        74514.0
2233        Columbia University in the City of New York        57208.0
930                               University of Chicago        56034.0
2451                                     Vassar College        55210.0
627                                     Trinity College        54770.0
...                                                 ...            ...
5415              Escuela De Troqueleria Y Herramentaje         1040.0
2448              United States Merchant Marine Academy         1020.0
4097                             Luna Community College          962.0
4974                   Tohono O'Odham Community College          932.0
1249                  Haskell Indian Nations University          480.0

[4021 rows x 2 columns]

In [67]:
college_data[college_data['TUITIONFEE_IN']>0][['INSTNM','TUITIONFEE_IN']].sort_values(ascending=True,by='TUITIONFEE_IN')

                                                 INSTNM  TUITIONFEE_IN
1249                  Haskell Indian Nations University          480.0
4974                   Tohono O'Odham Community College          932.0
4097                             Luna Community College          962.0
2448              United States Merchant Marine Academy         1020.0
5415              Escuela De Troqueleria Y Herramentaje         1040.0
...                                                 ...            ...
627                                     Trinity College        54770.0
2451                                     Vassar College        55210.0
930                               University of Chicago        56034.0
2233        Columbia University in the City of New York        57208.0
5199  Aviator College of Aeronautical Science and Te...        74514.0

[4021 rows x 2 columns]

I should explore the data by finding out answers that I find interesting
1. Best math schools by highest 75th percentile math sat
2. best english schools by higher 75th english sat
3. most expensive schools by tuition
4. least expensive schools by tuition
5. where the richest parnts kids go to school
6. most computer science degrees by percentage
7. Highest earning schools
8. Lowest Earning Schools 
9. heatmap of best school by cost,scores,and earnings/tuiton